dwisnie2/fw-custom-STM32_mega/generated/controllers/generated/rusefi_generated_STM32_mega.h
#define pin_output_mode_e_OM_DEFAULT 0
#define pin_output_mode_e_OM_INVERTED 1
#define pin_output_mode_e_OM_OPENDRAIN 2
#define pin_output_mode_e_OM_OPENDRAIN_INVERTED 3
#define PRIME_CURVE_COUNT 8
#define PROTOCOL_COIL_SHORT_PREFIX "c"
#define PROTOCOL_CRANK1 "t1"
#define PROTOCOL_CRANK2 "t2"
#define PROTOCOL_ENGINE_SNIFFER "wave_chart"
#define PROTOCOL_ES_DOWN "d"
#define PROTOCOL_ES_UP "u"
#define PROTOCOL_HELLO_PREFIX "***"
#define PROTOCOL_INJ_SHORT_PREFIX "i"
#define PROTOCOL_INJ_STAGE2_SHORT_PREFIX "j"
#define PROTOCOL_MSG "msg"
#define PROTOCOL_OUTPIN "outpin"
#define PROTOCOL_SIGNATURE_PREFIX "rusEFI "
#define PROTOCOL_TEST_RESPONSE_TAG "ts_p_alive"
#define PROTOCOL_VERSION_TAG "rusEfiVersion"
#define RANGE_INPUT_COUNT 6
#define REBOOT_COMMAND 0xbb
#define SCRIPT_CURVE_16 16
#define SCRIPT_CURVE_8 8
#define SCRIPT_CURVE_COUNT 6
#define SCRIPT_SETTING_COUNT 8
#define SCRIPT_TABLE_8 8
#define SCRIPT_TABLE_COUNT 4
#define SD_CARD_LABEL "rusEFI logs"
#define SelectedGear_Drive 6
#define SelectedGear_Invalid 0
#define SelectedGear_Low 11
#define SelectedGear_Manual 7
#define SelectedGear_Manual1 10
#define SelectedGear_Manual2 9
#define SelectedGear_Manual3 8
#define SelectedGear_ManualMinus 2
#define SelectedGear_ManualPlus 1
#define SelectedGear_Neutral 5
#define SelectedGear_Park 3
#define SelectedGear_Reverse 4
#define SENT_INPUT_COUNT 1
#define sent_input_pin_e_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define SentEtbType_auto_enum 0="NONE",3="CUSTOM",2="FORD_TYPE_1",1="GM_TYPE_1"
#define SentEtbType_CUSTOM 3
#define SentEtbType_enum "None", "GM type 1", "Ford type 1", "Custom"
#define SentEtbType_FORD_TYPE_1 2
#define SentEtbType_GM_TYPE_1 1
#define SentEtbType_NONE 0
#define SentFuelHighPressureType_auto_enum 0="NONE",1="GM_TYPE"
#define SentFuelHighPressureType_enum "None", "GM type", "Custom"
#define SentFuelHighPressureType_GM_TYPE 1
#define SentFuelHighPressureType_NONE 0
#define SentInput_auto_enum 0="NONE",1="INPUT1",2="INPUT2",3="INPUT3",4="INPUT4",5="INPUT5",6="INPUT6",7="INPUT7"
#define SentInput_enum "None", "SENT input 1", "SENT input 2", "SENT input 3", "SENT input 4", "SENT input 5", "SENT input 6", "SENT input 7"
#define SentInput_INPUT1 1
#define SentInput_INPUT2 2
#define SentInput_INPUT3 3
#define SentInput_INPUT4 4
#define SentInput_INPUT5 5
#define SentInput_INPUT6 6
#define SentInput_INPUT7 7
#define SentInput_NONE 0
#define show_tcu_gauges true
#define show_vvt_output_pin true
#define SIGNATURE_HASH 3109929869
#define SIMULATOR_TUNE_BIN_FILE_NAME "generated/simulator_tune_image.bin"
#define SIMULATOR_TUNE_BIN_FILE_NAME_PREFIX "generated/simulator_tune_image"
#define SIMULATOR_TUNE_BIN_FILE_NAME_SUFFIX ".bin"
#define smLaunchControl_NAME "Launch Control"
#define SMOOTHED_GAUGE_NAME_AFR "Smoothed Air/Fuel Ratio"
#define SMOOTHED_GAUGE_NAME_AFR2 "Smoothed Air/Fuel Ratio 2"
#define spi_device_e_auto_enum 0="SPI_NONE",1="SPI_DEVICE_1",2="SPI_DEVICE_2",3="SPI_DEVICE_3",4="SPI_DEVICE_4",5="SPI_DEVICE_5",6="SPI_DEVICE_6"
#define spi_device_e_SPI_DEVICE_1 1
#define spi_device_e_SPI_DEVICE_2 2
#define spi_device_e_SPI_DEVICE_3 3
#define spi_device_e_SPI_DEVICE_4 4
#define spi_device_e_SPI_DEVICE_5 5
#define spi_device_e_SPI_DEVICE_6 6
#define spi_device_e_SPI_NONE 0
#define stepper_num_micro_steps_e_auto_enum 0="STEPPER_FULL",8="STEPPER_EIGHTH",4="STEPPER_FOURTH",2="STEPPER_HALF"
#define stepper_num_micro_steps_e_enum "Full-Step (Default)", "INVALID", "Half-Step", "INVALID", "1/4 Micro-Step", "INVALID", "INVALID", "INVALID", "1/8 Micro-Step"
#define stepper_num_micro_steps_e_STEPPER_EIGHTH 8
#define stepper_num_micro_steps_e_STEPPER_FOURTH 4
#define stepper_num_micro_steps_e_STEPPER_FULL 0
#define stepper_num_micro_steps_e_STEPPER_HALF 2
#define STFT_BANK_COUNT 2
#define stft_cell_cfg_s_size 4
#define STFT_CELL_COUNT 4
#define stft_s_size 28
#define switch_input_pin_e_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define switch_input_pin_e_fullenum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define TABLE_2_LOAD_SIZE 8
#define TABLE_2_RPM_SIZE 8
#define TABLE_3_LOAD_SIZE 8
#define TABLE_3_RPM_SIZE 8
#define TABLE_4_RPM 10
#define TARGET_AFR_BLEND_COUNT 2
#define tChargeMode_e_auto_enum 0="TCHARGE_MODE_RPM_TPS",1="TCHARGE_MODE_AIR_INTERP",2="TCHARGE_MODE_AIR_INTERP_TABLE"
#define tChargeMode_e_enum "RPM+TPS (Default)", "Air Mass Interpolation", "Table"
#define tChargeMode_e_TCHARGE_MODE_AIR_INTERP 1
#define tChargeMode_e_TCHARGE_MODE_AIR_INTERP_TABLE 2
#define tChargeMode_e_TCHARGE_MODE_RPM_TPS 0
#define TCU_GEAR_COUNT 10
#define TCU_RANGE_COUNT 11
#define TCU_SOLENOID_COUNT 6
#define TCU_TABLE_WIDTH 8
#define thermistor_conf_s_size 28
#define ThermistorConf_size 32
#define THR_EST_SIZE 12
#define timing_mode_e_auto_enum 0="TM_DYNAMIC",1="TM_FIXED"
#define timing_mode_e_TM_DYNAMIC 0
#define timing_mode_e_TM_FIXED 1
#define tle8888_mode_e_auto_enum 0="TL_AUTO",3="TL_HALL",2="TL_MANUAL",1="TL_SEMI_AUTO"
#define tle8888_mode_e_TL_AUTO 0
#define tle8888_mode_e_TL_HALL 3
#define tle8888_mode_e_TL_MANUAL 2
#define tle8888_mode_e_TL_SEMI_AUTO 1
#define TMF_SIZE 2
#define TOOTH_DATA_LENGTH 2000
#define TOOTH_PACKET_COUNT 1000
#define TOOTH_PACKET_SIZE 2
#define TOP_DEAD_CENTER_MESSAGE "r"
#define TORQUE_CURVE_SIZE 6
#define torqueReductionActivationMode_e_auto_enum 0="TORQUE_REDUCTION_BUTTON",1="LAUNCH_BUTTON",2="TORQUE_REDUCTION_CLUTCH_DOWN_SWITCH",3="TORQUE_REDUCTION_CLUTCH_UP_SWITCH"
#define torqueReductionActivationMode_e_enum "Torque Reduction Button", "Launch Button", "Clutch Down Switch", "Clutch Up Switch"
#define torqueReductionActivationMode_e_LAUNCH_BUTTON 1
#define torqueReductionActivationMode_e_TORQUE_REDUCTION_BUTTON 0
#define torqueReductionActivationMode_e_TORQUE_REDUCTION_CLUTCH_DOWN_SWITCH 2
#define torqueReductionActivationMode_e_TORQUE_REDUCTION_CLUTCH_UP_SWITCH 3
#define TOTAL_CONFIG_SIZE 23576
#define TPS_2_BYTE_PACKING_MULT 100
#define TPS_PPS_TOO_HIGH_THRESHOLD 110
#define TPS_PPS_TOO_LOW_THRESHOLD -10
#define TPS_TPS_ACCEL_CLT_CORR_TABLE 4
#define TPS_TPS_ACCEL_TABLE 8
#define TRACTION_CONTROL_ETB_DROP_SIZE 6
#define TRAILING_SPARK_SIZE 4
#define transmission_controller_e_enum "None", "Simple Transmission", "Generic 4-Speed", "GM 4L6X"
#define TransmissionControllerMode_auto_enum 0="None",2="Generic4",3="Gm4l6x",1="SimpleTransmissionController"
#define TransmissionControllerMode_Generic4 2
#define TransmissionControllerMode_Gm4l6x 3
#define TransmissionControllerMode_None 0
#define TransmissionControllerMode_SimpleTransmissionController 1
#define TRIGGER_COMMENT "#"
#define trigger_config_s_size 12
#define TRIGGER_CRANK_BASED trigger_type == 2 || trigger_type == 5 || trigger_type == 10 || trigger_type == 12 || trigger_type == 20 || trigger_type == 21 || trigger_type == 26 || trigger_type == 27 || trigger_type == 33 || trigger_type == 38 || trigger_type == 39 || trigger_type == 44 || trigger_type == 45 || trigger_type == 46 || trigger_type == 53 || trigger_type == 55 || trigger_type == 57 || trigger_type == 58 || trigger_type == 61 || trigger_type == 62 || trigger_type == 68 || trigger_type == 70 || trigger_type == 71 || trigger_type == 72 || trigger_type == 74 || trigger_type == 75 || trigger_type == 76 || trigger_type == 77 || trigger_type == 84 || trigger_type == 87
#define TRIGGER_CYCLE_DURATION "cycleDuration"
#define TRIGGER_GAP_FROM "gapFrom"
#define TRIGGER_GAP_TO "gapTo"
#define TRIGGER_GAPS_COUNT "gapsCount"
#define TRIGGER_HAS_SECOND_CHANNEL "hasSecondChannel"
#define TRIGGER_INPUT_PIN_COUNT 2
#define TRIGGER_IS_CRANK_KEY "crankBased"
#define TRIGGER_IS_SECOND_WHEEL_CAM "isSecondWheelCam"
#define TRIGGER_KNOWN_OPERATION_MODE "knownOperationMode"
#define TRIGGER_SIMULATOR_PIN_COUNT 2
#define TRIGGER_SYNC_EDGE "syncEdge"
#define trigger_type_e_auto_enum 0="TT_TOOTHED_WHEEL",38="TT_12_TOOTH_CRANK",25="TT_2JZ_3_34_SIMULATION_ONLY",70="TT_36_2_1",71="TT_36_2_1_1",23="TT_36_2_2_2",31="TT_3_1_CAM",72="TT_3_TOOTH_CRANK",77="TT_60DEG_TOOTH",75="TT_60_2_2_F3R",20="TT_60_2_WRONG_POLARITY",80="TT_6_TOOTH_CRANK",85="TT_ARCTIC_CAT",21="TT_BENELLI_TRE",30="TT_CHRYSLER_NGC_36_2_2",88="TT_CUSTOM_1",89="TT_CUSTOM_2",6="TT_DAIHATSU_3_CYL",81="TT_DAIHATSU_4_CYL",83="TT_DEV",2="TT_DODGE_NEON_1995",39="TT_DODGE_NEON_1995_ONLY_CRANK",14="TT_DODGE_NEON_2003_CAM",32="TT_DODGE_NEON_2003_CRANK",19="TT_DODGE_RAM",22="TT_DODGE_STRATUS",41="TT_FIAT_IAW_P8",1="TT_FORD_ASPIRE",42="TT_FORD_ST170",65="TT_FORD_TFI_PIP",74="TT_GM_24x_3",27="TT_GM_24x_5",54="TT_GM_60_2_2_2",5="TT_GM_7X",18="TT_HALF_MOON",28="TT_HONDA_CBR_600",87="TT_HONDA_J30A2_24_1_1",67="TT_HONDA_K_CAM_4_1",46="TT_HONDA_K_CRANK_12_1",37="TT_JEEP_18_2_2_2",40="TT_JEEP_4_CYL",57="TT_KAWA_KX450F",15="TT_MAZDA_DOHC_1_4",3="TT_MAZDA_MIATA_NA",35="TT_MAZDA_MIATA_VVT_TEST",7="TT_MAZDA_SOHC_4",10="TT_MERCEDES_2_SEGMENT",33="TT_MIATA_VVT",34="TT_MITSU_4G63_CAM",76="TT_MITSU_4G63_CRANK",29="TT_MITSU_4G9x_CAM",11="TT_NARROW_SINGLE_TOOTH",84="TT_NISSAN_HR",86="TT_NISSAN_HR_CAM_IN",52="TT_NISSAN_MR18_CAM_VVT",68="TT_NISSAN_MR18_CRANK",61="TT_NISSAN_QR25",24="TT_NISSAN_SR20VE",60="TT_NISSAN_VQ30",58="TT_NISSAN_VQ35",16="TT_ONE_PLUS_ONE",44="TT_RENIX_44_2_2",45="TT_RENIX_66_2_2_2",26="TT_ROVER_K",55="TT_SKODA_FAVORIT",36="TT_SUBARU_7_6",51="TT_SUBARU_7_WITHOUT_6",12="TT_SUBARU_EZ30",49="TT_SUBARU_SVX",64="TT_SUBARU_SVX_CAM_VVT",63="TT_SUBARU_SVX_CRANK_1",66="TT_SUZUKI_G13B",50="TT_SUZUKI_K6A",69="TT_TOOTHED_WHEEL_32_2",9="TT_TOOTHED_WHEEL_36_1",48="TT_TOOTHED_WHEEL_36_2",8="TT_TOOTHED_WHEEL_60_2",53="TT_TRI_TACH",90="TT_UNUSED",56="TT_VVT_BARRA_3_PLUS_1",47="TT_VVT_BOSCH_QUICK_START",4="TT_VVT_FORD_COYOTE",82="TT_VVT_MAZDA_L",13="TT_VVT_MAZDA_SKYACTIV",43="TT_VVT_MIATA_NB",62="TT_VVT_MITSUBISHI_3A92",78="TT_VVT_MITSUBISHI_4G69",79="TT_VVT_MITSU_6G72",59="TT_VVT_NISSAN_VQ35",17="TT_VVT_TOYOTA_3_TOOTH",73="TT_VVT_TOYOTA_4_1"
#define trigger_type_e_enum "custom toothed wheel", "Ford Aspire", "Dodge Neon 1995", "Miata NA", "INVALID", "GM_7X", "Daihatsu 3 cylinder", "Mazda SOHC 4", "60-2", "36-1", "Mercedes Two Segment", "Single Tooth", "EZ30", "INVALID", "Dodge Neon 2003", "Mazda DOHC 1+4", "1+1", "INVALID", "Half Moon", "Dodge Ram 1+16", "60-2 Wrong Polarity", "Benelli Tre", "Dodge Stratus", "36_2_2_2", "Nissan Primera", "dev 2JZ 3/34 simulator", "Rover K", "GM 24x 5 degree", "Honda CBR 600 Cam", "INVALID", "Honda CBR 600 custom", "3-1 skipped", "Dodge Neon 2003 crank", "Miata NB", "INVALID", "INVALID", "Subaru 7+6", "Jeep 18-2-2-2", "12crank/24cam", "Dodge Neon 1995 crank only", "Jeep XJ 4 cyl", "FiatIAQ_P8", "Mazda Z5", "INVALID", "Renix 44-2-2", "Renix 66-2-2-2", "Honda K 12+1", "INVALID", "36-2", "Subaru SVX", "Suzuki K6A", "Subaru 7 without 6", "INVALID", "INVALID", "GM 60-2-2-2", "Skoda Favorit", "Barra 3+1 Cam", "Kawa KX450F", "Nissan VQ35", "INVALID", "Nissan VQ30", "Nissan QR25", "INVALID", "Subaru SVX Crank 1", "Subaru SVX Cam VVT", "Ford PIP", "Suzuki G13B", "Honda K 4+1", "Nissan MR18 Crank", "32-2", "36-2-1", "36-2-1-1", "3-0", "INVALID", "GM 24x 3 degree", "60-2-2 F3R", "Mitsu 4G63 Crank", "x2 30 Deg camshaft BTDC", "INVALID", "Mitsu 6G72 Cam", "6-0", "Daihatsu 4 cylinder", "INVALID", "dev", "Nissan HR", "Arctic Cat", "HR12 in", "HONDA J30A2", "trg88"
#define trigger_type_e_TT_12_TOOTH_CRANK 38
#define trigger_type_e_TT_2JZ_3_34_SIMULATION_ONLY 25
#define trigger_type_e_TT_36_2_1 70
#define trigger_type_e_TT_36_2_1_1 71
#define trigger_type_e_TT_36_2_2_2 23
#define trigger_type_e_TT_3_1_CAM 31
#define trigger_type_e_TT_3_TOOTH_CRANK 72
#define trigger_type_e_TT_60_2_2_F3R 75
#define trigger_type_e_TT_60_2_WRONG_POLARITY 20
#define trigger_type_e_TT_60DEG_TOOTH 77
#define trigger_type_e_TT_6_TOOTH_CRANK 80
#define trigger_type_e_TT_ARCTIC_CAT 85
#define trigger_type_e_TT_BENELLI_TRE 21
#define trigger_type_e_TT_CHRYSLER_NGC_36_2_2 30
#define trigger_type_e_TT_CUSTOM_1 88
#define trigger_type_e_TT_CUSTOM_2 89
#define trigger_type_e_TT_DAIHATSU_3_CYL 6
#define trigger_type_e_TT_DAIHATSU_4_CYL 81
#define trigger_type_e_TT_DEV 83
#define trigger_type_e_TT_DODGE_NEON_1995 2
#define trigger_type_e_TT_DODGE_NEON_1995_ONLY_CRANK 39
#define trigger_type_e_TT_DODGE_NEON_2003_CAM 14
#define trigger_type_e_TT_DODGE_NEON_2003_CRANK 32
#define trigger_type_e_TT_DODGE_RAM 19
#define trigger_type_e_TT_DODGE_STRATUS 22
#define trigger_type_e_TT_FIAT_IAW_P8 41
#define trigger_type_e_TT_FORD_ASPIRE 1
#define trigger_type_e_TT_FORD_ST170 42
#define trigger_type_e_TT_FORD_TFI_PIP 65
#define trigger_type_e_TT_GM_24x_3 74
#define trigger_type_e_TT_GM_24x_5 27
#define trigger_type_e_TT_GM_60_2_2_2 54
#define trigger_type_e_TT_GM_7X 5
#define trigger_type_e_TT_HALF_MOON 18
#define trigger_type_e_TT_HONDA_CBR_600 28
#define trigger_type_e_TT_HONDA_J30A2_24_1_1 87
#define trigger_type_e_TT_HONDA_K_CAM_4_1 67
#define trigger_type_e_TT_HONDA_K_CRANK_12_1 46
#define trigger_type_e_TT_JEEP_18_2_2_2 37
#define trigger_type_e_TT_JEEP_4_CYL 40
#define trigger_type_e_TT_KAWA_KX450F 57
#define trigger_type_e_TT_MAZDA_DOHC_1_4 15
#define trigger_type_e_TT_MAZDA_MIATA_NA 3
#define trigger_type_e_TT_MAZDA_MIATA_VVT_TEST 35
#define trigger_type_e_TT_MAZDA_SOHC_4 7
#define trigger_type_e_TT_MERCEDES_2_SEGMENT 10
#define trigger_type_e_TT_MIATA_VVT 33
#define trigger_type_e_TT_MITSU_4G63_CAM 34
#define trigger_type_e_TT_MITSU_4G63_CRANK 76
#define trigger_type_e_TT_MITSU_4G9x_CAM 29
#define trigger_type_e_TT_NARROW_SINGLE_TOOTH 11
#define trigger_type_e_TT_NISSAN_HR 84
#define trigger_type_e_TT_NISSAN_HR_CAM_IN 86
#define trigger_type_e_TT_NISSAN_MR18_CAM_VVT 52
#define trigger_type_e_TT_NISSAN_MR18_CRANK 68
#define trigger_type_e_TT_NISSAN_QR25 61
#define trigger_type_e_TT_NISSAN_SR20VE 24
#define trigger_type_e_TT_NISSAN_VQ30 60
#define trigger_type_e_TT_NISSAN_VQ35 58
#define trigger_type_e_TT_ONE_PLUS_ONE 16
#define trigger_type_e_TT_RENIX_44_2_2 44
#define trigger_type_e_TT_RENIX_66_2_2_2 45
#define trigger_type_e_TT_ROVER_K 26
#define trigger_type_e_TT_SKODA_FAVORIT 55
#define trigger_type_e_TT_SUBARU_7_6 36
#define trigger_type_e_TT_SUBARU_7_WITHOUT_6 51
#define trigger_type_e_TT_SUBARU_EZ30 12
#define trigger_type_e_TT_SUBARU_SVX 49
#define trigger_type_e_TT_SUBARU_SVX_CAM_VVT 64
#define trigger_type_e_TT_SUBARU_SVX_CRANK_1 63
#define trigger_type_e_TT_SUZUKI_G13B 66
#define trigger_type_e_TT_SUZUKI_K6A 50
#define trigger_type_e_TT_TOOTHED_WHEEL 0
#define trigger_type_e_TT_TOOTHED_WHEEL_32_2 69
#define trigger_type_e_TT_TOOTHED_WHEEL_36_1 9
#define trigger_type_e_TT_TOOTHED_WHEEL_36_2 48
#define trigger_type_e_TT_TOOTHED_WHEEL_60_2 8
#define trigger_type_e_TT_TRI_TACH 53
#define trigger_type_e_TT_UNUSED 90
#define trigger_type_e_TT_VVT_BARRA_3_PLUS_1 56
#define trigger_type_e_TT_VVT_BOSCH_QUICK_START 47
#define trigger_type_e_TT_VVT_FORD_COYOTE 4
#define trigger_type_e_TT_VVT_MAZDA_L 82
#define trigger_type_e_TT_VVT_MAZDA_SKYACTIV 13
#define trigger_type_e_TT_VVT_MIATA_NB 43
#define trigger_type_e_TT_VVT_MITSU_6G72 79
#define trigger_type_e_TT_VVT_MITSUBISHI_3A92 62
#define trigger_type_e_TT_VVT_MITSUBISHI_4G69 78
#define trigger_type_e_TT_VVT_NISSAN_VQ35 59
#define trigger_type_e_TT_VVT_TOYOTA_3_TOOTH 17
#define trigger_type_e_TT_VVT_TOYOTA_4_1 73
#define TRIGGER_TYPE_WITH_SECOND_WHEEL trigger_type == 1 || trigger_type == 3 || trigger_type == 15 || trigger_type == 16 || trigger_type == 19 || trigger_type == 25 || trigger_type == 31 || trigger_type == 35 || trigger_type == 36 || trigger_type == 37 || trigger_type == 40 || trigger_type == 49 || trigger_type == 53 || trigger_type == 54 || trigger_type == 63 || trigger_type == 64
#define TRIGGER_TYPE_WITHOUT_KNOWN_LOCATION trigger_type == 8 || trigger_type == 9 || trigger_type == 11 || trigger_type == 17 || trigger_type == 18 || trigger_type == 23 || trigger_type == 48 || trigger_type == 69 || trigger_type == 73 || trigger_type == 88 || trigger_type == 89
#define TRIGGER_WITH_SYNC "isSynchronizationNeeded"
#define TRIGGERS_FILE_NAME "triggers.txt"
#define TriggerWheel_T_PRIMARY 0
#define TriggerWheel_T_SECONDARY 1
#define ts_14_command_COMMAND_X14_UNUSED_0 0x00
#define ts_14_command_COMMAND_X14_UNUSED_1 0x01
#define ts_14_command_COMMAND_X14_UNUSED_2 0x02
#define ts_14_command_COMMAND_X14_UNUSED_3 0x03
#define ts_14_command_COMMAND_X14_UNUSED_4 0x04
#define ts_14_command_COMMAND_X14_UNUSED_5 0x05
#define ts_14_command_COMMAND_X14_UNUSED_9 0x09
#define ts_14_command_TS_BURN_WITHOUT_FLASH 0x15
#define ts_14_command_TS_ETB_AUTOCAL_0 0x0E
#define ts_14_command_TS_ETB_AUTOCAL_0_FAST 0x1C
#define ts_14_command_TS_ETB_AUTOCAL_1 0x11
#define ts_14_command_TS_ETB_AUTOCAL_1_FAST 0x1D
#define ts_14_command_TS_ETB_DISABLE_JAM_DETECT 0x14
#define ts_14_command_TS_ETB_RESET 0x0B
#define ts_14_command_TS_ETB_START_AUTOTUNE 0x0C
#define ts_14_command_TS_ETB_STOP_AUTOTUNE 0x10
#define ts_14_command_TS_EXTERNAL_TRIGGER_STIMULATOR_ENABLE 0x13
#define ts_14_command_TS_GRAB_PEDAL_UP 6
#define ts_14_command_TS_GRAB_PEDAL_WOT 7
#define ts_14_command_TS_RESET_MC33810 0x16
#define ts_14_command_TS_RESET_TLE8888 8
#define ts_14_command_TS_SD_DELETE_REPORTS 0x1B
#define ts_14_command_TS_SD_FORMAT 0x1A
#define ts_14_command_TS_SD_MOUNT_ECU 0x18
#define ts_14_command_TS_SD_MOUNT_PC 0x17
#define ts_14_command_TS_SD_UNMOUNT 0x19
#define ts_14_command_TS_TRIGGER_STIMULATOR_DISABLE 0x0F
#define ts_14_command_TS_TRIGGER_STIMULATOR_ENABLE 0x0D
#define ts_14_command_TS_WIDEBAND_UPDATE 0x12
#define ts_14_command_TS_WRITE_FLASH 0x0A
#define TS_BLOCK_READ_TIMEOUT 3000
#define TS_BURN_COMMAND 'B'
#define TS_BURN_COMMAND_char B
#define TS_CHUNK_WRITE_COMMAND 'C'
#define TS_CHUNK_WRITE_COMMAND_char C
#define ts_cic_idle false
#define ts_command_e_TS_BENCH_CATEGORY 22
#define ts_command_e_TS_BOARD_ACTION 29
#define ts_command_e_TS_CLEAR_WARNINGS 17
#define ts_command_e_TS_COMMAND_1 1
#define ts_command_e_TS_COMMAND_10 10
#define ts_command_e_TS_COMMAND_11 11
#define ts_command_e_TS_COMMAND_12 12
#define ts_command_e_TS_COMMAND_13 13
#define ts_command_e_TS_COMMAND_14 14
#define ts_command_e_TS_COMMAND_15 15
#define ts_command_e_TS_COMMAND_16 16
#define ts_command_e_TS_COMMAND_2 2
#define ts_command_e_TS_COMMAND_3 3
#define ts_command_e_TS_COMMAND_4 4
#define ts_command_e_TS_COMMAND_5 5
#define ts_command_e_TS_COMMAND_6 6
#define ts_command_e_TS_COMMAND_7 7
#define ts_command_e_TS_COMMAND_8 8
#define ts_command_e_TS_COMMAND_9 9
#define ts_command_e_TS_DEBUG_MODE 0
#define ts_command_e_TS_IGNITION_CATEGORY 18
#define ts_command_e_TS_INJECTOR_CATEGORY 19
#define ts_command_e_TS_LUA_OUTPUT_CATEGORY 32
#define ts_command_e_TS_SET_DEFAULT_ENGINE 31
#define ts_command_e_TS_SET_ENGINE_TYPE 30
#define ts_command_e_TS_SOLENOID_CATEGORY 25
#define ts_command_e_TS_UNUSED_23 23
#define ts_command_e_TS_UNUSED_24 24
#define ts_command_e_TS_UNUSED_26 26
#define ts_command_e_TS_UNUSED_27 27
#define ts_command_e_TS_UNUSED_28 28
#define ts_command_e_TS_WIDEBAND 21
#define ts_command_e_TS_X14 20
#define TS_COMMAND_F 'F'
#define TS_COMMAND_F_char F
#define TS_COMPOSITE_DISABLE 2
#define TS_COMPOSITE_ENABLE 1
#define TS_COMPOSITE_READ 3
#define TS_CRC_CHECK_COMMAND 'k'
#define TS_CRC_CHECK_COMMAND_char k
#define TS_EXECUTE 'E'
#define TS_EXECUTE_char E
#define TS_GET_COMPOSITE_BUFFER_DONE_DIFFERENTLY '8'
#define TS_GET_COMPOSITE_BUFFER_DONE_DIFFERENTLY_char 8
#define TS_GET_CONFIG_ERROR 'e'
#define TS_GET_CONFIG_ERROR_char e
#define TS_GET_FIRMWARE_VERSION 'V'
#define TS_GET_FIRMWARE_VERSION_char V
#define TS_GET_OUTPUTS_SIZE '4'
#define TS_GET_OUTPUTS_SIZE_char 4
#define TS_GET_PROTOCOL_VERSION_COMMAND_F 'F'
#define TS_GET_PROTOCOL_VERSION_COMMAND_F_char F
#define TS_GET_SCATTERED_GET_COMMAND '9'
#define TS_GET_SCATTERED_GET_COMMAND_char 9
#define TS_GET_TEXT 'G'
#define TS_GET_TEXT_char G
#define TS_HELLO_COMMAND 'S'
#define TS_HELLO_COMMAND_char S
#define TS_IO_TEST_COMMAND 'Z'
#define TS_IO_TEST_COMMAND_char Z
#define TS_ONLINE_PROTOCOL 'z'
#define TS_ONLINE_PROTOCOL_char z
#define TS_OUTPUT_ALL_COMMAND 'A'
#define TS_OUTPUT_ALL_COMMAND_char A
#define TS_OUTPUT_COMMAND 'O'
#define TS_OUTPUT_COMMAND_char O
#define TS_PERF_TRACE_BEGIN '_'
#define TS_PERF_TRACE_BEGIN_char _
#define TS_PERF_TRACE_GET_BUFFER 'b'
#define TS_PERF_TRACE_GET_BUFFER_char b
#define TS_PROTOCOL "001"
#define TS_QUERY_BOOTLOADER 'L'
#define TS_QUERY_BOOTLOADER_char L
#define TS_QUERY_BOOTLOADER_NONE 0
#define TS_QUERY_BOOTLOADER_OPENBLT 1
#define TS_QUERY_COMMAND 'Q'
#define TS_QUERY_COMMAND_char Q
#define TS_READ_COMMAND 'R'
#define TS_READ_COMMAND_char R
#define TS_RESPONSE_BURN_OK 4
#define TS_RESPONSE_CRC_FAILURE 0x82
#define TS_RESPONSE_FRAMING_ERROR 0x8D
#define TS_RESPONSE_OK 0
#define TS_RESPONSE_OUT_OF_RANGE 0x84
#define TS_RESPONSE_OVERRUN 0x81
#define TS_RESPONSE_UNDERRUN 0x80
#define TS_RESPONSE_UNRECOGNIZED_COMMAND 0x83
#define TS_SET_LOGGER_SWITCH 'l'
#define TS_SET_LOGGER_SWITCH_char l
#define ts_show_acr_pins true
#define ts_show_AdvanceCorrectionsForCranking true
#define ts_show_air_conditioning true
#define ts_show_alternator true
