dwisnie2/fw-custom-STM32_mega/generated/controllers/generated/rusefi_generated_STM32_mega.h
#define ts_show_analog_diag false
#define ts_show_analog_divider true
#define ts_show_analog_ego true
#define ts_show_analog_input_settings true
#define ts_show_aux_connections true
#define ts_show_aux_sensors true
#define ts_show_auxserial_pins true
#define ts_show_bank2_cam1 true
#define ts_show_bank2_cam2 true
#define ts_show_brake_pedal_indicator true
#define ts_show_brake_pedal_pin true
#define ts_show_cam2 true
#define ts_show_can2 true
#define ts_show_can_bitrate true
#define ts_show_can_pins true
#define ts_show_can_wbo true
#define ts_show_charge_estimation true
#define ts_show_check_engine false
#define ts_show_clt_iat_pullup true
#define ts_show_clutch_down true
#define ts_show_clutch_down_pin true
#define ts_show_clutch_up true
#define ts_show_clutch_up_pin true
#define ts_show_communityCommsLedPin false
#define ts_show_compression_ratio false
#define ts_show_compressor_sensor true
#define ts_show_console_settings true
#define ts_show_crankingTpsCurve true
#define ts_show_cylinder_10 true
#define ts_show_cylinder_11 true
#define ts_show_cylinder_12 true
#define ts_show_cylinder_2 true
#define ts_show_cylinder_3 true
#define ts_show_cylinder_4 true
#define ts_show_cylinder_5 true
#define ts_show_cylinder_6 true
#define ts_show_cylinder_7 true
#define ts_show_cylinder_8 true
#define ts_show_cylinder_9 true
#define ts_show_cylinder_bank true
#define ts_show_debug_mode false
#define ts_show_ego2 true
#define ts_show_egt true
#define ts_show_etb true
#define ts_show_etb_bias_curve true
#define ts_show_etb_extra_monitoring 
#define ts_show_etb_frequency true
#define ts_show_etb_pins true
#define ts_show_exhaust_vvt true
#define ts_show_experimental true
#define ts_show_fan2_settings true
#define ts_show_faster_spin_up true
#define ts_show_final_ratio true
#define ts_show_firing_order true
#define ts_show_flex_inverted true
#define ts_show_flood_clear true
#define ts_show_forced_induction false
#define ts_show_ford_toyota_tps_pps true
#define ts_show_FractionDivisor true
#define ts_show_fuel_level_sensor true
#define ts_show_fuel_pressure_sensor true
#define ts_show_fuel_pump true
#define ts_show_fuel_relay_pin true
#define ts_show_fuel_strategy true
#define ts_show_fuel_temp_sensor true
#define ts_show_fuel_threshold true
#define ts_show_fuel_trim_cylinder_1 true
#define ts_show_fuel_trim_cylinder_10 true
#define ts_show_fuel_trim_cylinder_11 true
#define ts_show_fuel_trim_cylinder_12 true
#define ts_show_fuel_trim_cylinder_2 true
#define ts_show_fuel_trim_cylinder_3 true
#define ts_show_fuel_trim_cylinder_4 true
#define ts_show_fuel_trim_cylinder_5 true
#define ts_show_fuel_trim_cylinder_6 true
#define ts_show_fuel_trim_cylinder_7 true
#define ts_show_fuel_trim_cylinder_8 true
#define ts_show_fuel_trim_cylinder_9 true
#define ts_show_fuel_trims true
#define ts_show_full_pinout true
#define ts_show_gdi true
#define ts_show_gdi_low_level true
#define ts_show_globalTriggerAngleOffset true
#define ts_show_hardware_simulator true
#define ts_show_hbridge_function true
#define ts_show_hd true
#define ts_show_hip9011 true
#define ts_show_iat true
#define ts_show_idle_hardware true
#define ts_show_ign_key_analog_input false
#define ts_show_ign_key_switch false
#define ts_show_ignitionOutputs true
#define ts_show_ignitionPinMode true
#define ts_show_inj_diag false
#define ts_show_injection_hardware true
#define ts_show_injection_mode true
#define ts_show_injection_phase true
#define ts_show_injectionPinMode true
#define ts_show_intake_cam_edge true
#define ts_show_intake_vvt_direction true
#define ts_show_jam_detection true
#define ts_show_k_line true
#define ts_show_knock_cylinder_mapping true
#define ts_show_l9779 false
#define ts_show_maf true
#define ts_show_main_relay true
#define ts_show_main_relay_microRusEFI_message false
#define ts_show_mc33810 false
#define ts_show_mc33810_cs false
#define ts_show_multispark true
#define ts_show_number_of_cylinders true
#define ts_show_odd_fire true
#define ts_show_oil_pressure_sensor true
#define ts_show_oil_sensors true
#define ts_show_oil_temp_sensor true
#define ts_show_onboard_accelerometer false
#define ts_show_output_diag true
#define ts_show_popular_vehicles true
#define ts_show_primary_trigger true
#define ts_show_reboot_to_dfu true
#define ts_show_reset_calibrations true
#define ts_show_rotary true
#define ts_show_sd_card true
#define ts_show_sd_pins true
#define ts_show_second_bank true
#define ts_show_sent true
#define ts_show_software_knock true
#define ts_show_speedo_settings true
#define ts_show_spi true
#define ts_show_spi1_enable true
#define ts_show_spi1_pins true
#define ts_show_spi2_enable true
#define ts_show_spi2_pins true
#define ts_show_spi3_enable true
#define ts_show_spi3_pins true
#define ts_show_spi4_enable true
#define ts_show_spi4_pins false
#define ts_show_spi5_enable true
#define ts_show_spi5_pins false
#define ts_show_spi6_enable true
#define ts_show_spi6_pins false
#define ts_show_staged_injection true
#define ts_show_start_button true
#define ts_show_starter_disable true
#define ts_show_startup_map_baro_grab true
#define ts_show_status_leds false
#define ts_show_strokes true
#define ts_show_sync_cam true
#define ts_show_tachometer true
#define ts_show_tcu true
#define ts_show_throttle_switch true
#define ts_show_tle8888 false
#define ts_show_top_level_can_menu true
#define ts_show_tps2 true
#define ts_show_tps_sent false
#define ts_show_trigger_advanced true
#define ts_show_trigger_comparator false
#define ts_show_trigger_gap_override_flag true
#define ts_show_trigger_overrides true
#define ts_show_trigger_pins true
#define ts_show_tsp_pps_limits true
#define ts_show_tunerstudio_port true
#define ts_show_useRunningMathForCranking true
#define ts_show_useSeparateVeForIdle true
#define ts_show_vbatt true
#define ts_show_ve_blend true
#define ts_show_veBlends2 true
#define ts_show_veBlends3 true
#define ts_show_veBlends4 true
#define ts_show_vehicle_speed_sensor true
#define ts_show_vr_threshold_2 false
#define ts_show_vr_threshold_all false
#define ts_show_vr_threshold_pins true
#define ts_show_vvt_output true
#define ts_show_vvt_output_pin true
#define ts_show_wastegate_sensor true
#define ts_show_wbo_canbus_index true
#define ts_show_wbo_canbus_set_index true
#define TS_SIGNATURE "rusEFI main.2025.11.01.STM32_mega.3109929869"
#define TS_SIMULATE_CAN '>'
#define TS_SIMULATE_CAN_char >
#define TS_SINGLE_WRITE_COMMAND 'W'
#define TS_SINGLE_WRITE_COMMAND_char W
#define TS_TEST_COMMAND 't'
#define TS_TEST_COMMAND_char t
#define TS_TOTAL_OUTPUT_SIZE 1832
#define TS_TRIGGER_SCOPE_CHANNEL_1_NAME "Channel 1"
#define TS_TRIGGER_SCOPE_CHANNEL_2_NAME "Channel 2"
#define TS_TRIGGER_SCOPE_DISABLE 5
#define TS_TRIGGER_SCOPE_ENABLE 4
#define TS_TRIGGER_SCOPE_READ 6
#define TsCalMode_EtbKd 5
#define TsCalMode_EtbKi 4
#define TsCalMode_EtbKp 3
#define TsCalMode_None 0
#define TsCalMode_PedalMax 13
#define TsCalMode_PedalMin 12
#define TsCalMode_Tps1Max 1
#define TsCalMode_Tps1Min 2
#define TsCalMode_Tps1SecondaryMax 6
#define TsCalMode_Tps1SecondaryMin 7
#define TsCalMode_Tps2Max 8
#define TsCalMode_Tps2Min 9
#define TsCalMode_Tps2SecondaryMax 10
#define TsCalMode_Tps2SecondaryMin 11
#define TUNING_DETECTOR_PERSISTENCE_OFFSET -1
#define uart_device_e_auto_enum 0="UART_NONE",1="UART_DEVICE_1",2="UART_DEVICE_2",3="UART_DEVICE_3",4="UART_DEVICE_4"
#define uart_device_e_UART_DEVICE_1 1
#define uart_device_e_UART_DEVICE_2 2
#define uart_device_e_UART_DEVICE_3 3
#define uart_device_e_UART_DEVICE_4 4
#define uart_device_e_UART_NONE 0
#define UiMode_auto_enum 0="FULL",1="INSTALLATION",2="TUNING"
#define UiMode_enum "Full", "INVALID", "Tuning"
#define UiMode_FULL 0
#define UiMode_INSTALLATION 1
#define UiMode_TUNING 2
#define VBAT_INJECTOR_CURVE_PRESSURE_SIZE 2
#define VBAT_INJECTOR_CURVE_SIZE 8
#define VE_BLEND1_TABLE_NAME "VE blend 1"
#define VE_BLEND_COUNT 4
#define VE_LOAD_COUNT 16
#define VE_MENU_MAP_NAME "VE 3D view"
#define VE_MENU_NAME "VE"
#define ve_override_e_auto_enum 0="VE_None",1="VE_MAP",2="VE_TPS"
#define ve_override_e_enum "None", "MAP", "TPS"
#define ve_override_e_VE_MAP 1
#define ve_override_e_VE_None 0
#define ve_override_e_VE_TPS 2
#define VE_RPM_COUNT 16
#define VE_TABLE_NAME "VE Table"
#define VEHICLE_INFO_SIZE 32
#define VIN_NUMBER_SIZE 17
#define VOLTAGE_1_BYTE_PACKING_DIV 0.02
#define VR_THRESHOLD_COUNT 2
#define vr_threshold_s_size 16
#define VSS_FILTER_MAX 200
#define VSS_FILTER_MIN 3
#define VVT1_TARGET_NAME "VVT intake target"
#define VVT_25_NAME "INVALID"
#define VVT_26_NAME "INVALID"
#define vvt_mode_e_auto_enum 0="VVT_INACTIVE",8="VVT_BARRA_3_PLUS_1",5="VVT_BOSCH_QUICK_START",25="VVT_CUSTOM_25",26="VVT_CUSTOM_26",23="VVT_DEV",19="VVT_FORD_COYOTE",7="VVT_FORD_ST170",21="VVT_HONDA_CBR_600",16="VVT_HONDA_K_EXHAUST",10="VVT_HONDA_K_INTAKE",24="VVT_HR12DDR_IN",13="VVT_MAP_V_TWIN",22="VVT_MAZDA_L",15="VVT_MAZDA_SKYACTIV",3="VVT_MIATA_NB",12="VVT_MITSUBISHI_3A92",18="VVT_MITSUBISHI_4G63",4="VVT_MITSUBISHI_4G69",17="VVT_MITSUBISHI_4G9x",20="VVT_MITSUBISHI_6G72",11="VVT_NISSAN_MR",9="VVT_NISSAN_VQ",1="VVT_SINGLE_TOOTH",2="VVT_TOYOTA_3_TOOTH",6="VVT_TOYOTA_4_1",14="VVT_UNUSED14"
#define vvt_mode_e_enum "Inactive", "Single Tooth", "Toyota 3 Tooth", "Miata NB2", "Mitsu 4G69", "Bosch Quick Start", "4/1", "ST 170", "Ford Barra 3+1", "Nissan VQ", "Honda K Intake", "Nissan MR18", "Mitsu 3A92", "Sync by MAP", "INVALID", "Mazda Skyactiv", "Honda K Exhaust", "Mitsubishi 4G92/93/94", "Mitsubishi 4G63", "Ford Coyote", "Mitsu 6G72", "Honda 600", "Mazda L", "Dev", "HR12DDR In", "INVALID", "INVALID", "vvt27", "vvt28"
#define vvt_mode_e_VVT_BARRA_3_PLUS_1 8
#define vvt_mode_e_VVT_BOSCH_QUICK_START 5
#define vvt_mode_e_VVT_CUSTOM_25 25
#define vvt_mode_e_VVT_CUSTOM_26 26
#define vvt_mode_e_VVT_DEV 23
#define vvt_mode_e_VVT_FORD_COYOTE 19
#define vvt_mode_e_VVT_FORD_ST170 7
#define vvt_mode_e_VVT_HONDA_CBR_600 21
#define vvt_mode_e_VVT_HONDA_K_EXHAUST 16
#define vvt_mode_e_VVT_HONDA_K_INTAKE 10
#define vvt_mode_e_VVT_HR12DDR_IN 24
#define vvt_mode_e_VVT_INACTIVE 0
#define vvt_mode_e_VVT_MAP_V_TWIN 13
#define vvt_mode_e_VVT_MAZDA_L 22
#define vvt_mode_e_VVT_MAZDA_SKYACTIV 15
#define vvt_mode_e_VVT_MIATA_NB 3
#define vvt_mode_e_VVT_MITSUBISHI_3A92 12
#define vvt_mode_e_VVT_MITSUBISHI_4G63 18
#define vvt_mode_e_VVT_MITSUBISHI_4G69 4
#define vvt_mode_e_VVT_MITSUBISHI_4G9x 17
#define vvt_mode_e_VVT_MITSUBISHI_6G72 20
#define vvt_mode_e_VVT_NISSAN_MR 11
#define vvt_mode_e_VVT_NISSAN_VQ 9
#define vvt_mode_e_VVT_SINGLE_TOOTH 1
#define vvt_mode_e_VVT_TOYOTA_3_TOOTH 2
#define vvt_mode_e_VVT_TOYOTA_4_1 6
#define vvt_mode_e_VVT_UNUSED14 14
#define VVT_OFFSET_1_1_NAME "VVT offset bank 1 intake"
#define VVT_TABLE_SIZE 8
#define VVT_TRACKING_LENGTH 4
#define WARNING_BUFFER_SIZE 120
#define WWAE_TABLE_SIZE 8
